import { ref } from "vue";

import 木桩图 from '../assets/img/monster/木桩.png'
import 蟑螂图 from '../assets/img/monster/蟑螂.png'
import 蜈蚣图 from '../assets/img/monster/蜈蚣.png'
import 蛇图 from '../assets/img/monster/蛇.png'
import 地牢守卫图 from '../assets/img/monster/地牢守卫.png'
import 蜘蛛图 from '../assets/img/monster/蜘蛛.png'
import 青蛙图 from '../assets/img/monster/青蛙.png'

const 木桩 = { type: '怪物', name: '木桩', img: 木桩图, desc: '木桩 等级1', 等级: 99, 气血: 99999, 当前气血: 99999, 内力: 99999, 当前内力: 99999, 外攻: 7, 内攻: 7, 防御: 99999, 身法: 7, 元素抗性: 50, 金钱: 10, 经验: 10, 元宝: 0 }
const 蟑螂 = { type: '怪物', name: '蟑螂', img: 蟑螂图, desc: '蟑螂 等级1', 等级: 1, 气血: 100, 当前气血: 100, 内力: 100, 当前内力: 100, 外攻: 10, 内攻: 10, 防御: 10, 身法: 10, 元素抗性: 100, 金钱: 10, 经验: 10, 元宝: 0 }
const 蜈蚣 = { type: '怪物', name: '蜈蚣', img: 蜈蚣图, desc: '蜈蚣 等级5', 等级: 5, 气血: 500, 当前气血: 500, 内力: 100, 当前内力: 100, 外攻: 50, 内攻: 50, 防御: 50, 身法: 50, 元素抗性: 100, 金钱: 50, 经验: 50, 元宝: 0 }
const 蛇 = { type: '怪物', name: '蛇', img: 蛇图, desc: '蛇 等级9', 等级: 9, 气血: 900, 当前气血: 900, 内力: 100, 当前内力: 100, 外攻: 90, 内攻: 90, 防御: 90, 身法: 90, 元素抗性: 100, 金钱: 90, 经验: 90, 元宝: 0 }
const 蜘蛛 = { type: '怪物', name: '蜘蛛', img: 蜘蛛图, desc: '蜘蛛 等级14', 等级: 13, 气血: 1300, 当前气血: 1300, 内力: 100, 当前内力: 100, 外攻: 130, 内攻: 130, 防御: 130, 身法: 130, 元素抗性: 100, 金钱: 130, 经验: 130, 元宝: 0 }
const 青蛙 = { type: '怪物', name: '青蛙', img: 青蛙图, desc: '青蛙 等级17', 等级: 17, 气血: 1700, 当前气血: 1700, 内力: 100, 当前内力: 100, 外攻: 170, 内攻: 170, 防御: 170, 身法: 170, 元素抗性: 100, 金钱: 170, 经验: 170, 元宝: 0 }
const 地牢守卫 = { type: '怪物', name: '地牢守卫', img: 地牢守卫图, desc: '地牢守卫 等级20', 等级: 20, 气血: 2000, 当前气血: 2000, 内力: 100, 当前内力: 100, 外攻: 200, 内攻: 200, 防御: 200, 身法: 200, 元素抗性: 200, 金钱: 200, 经验: 200, 元宝: 0 }
export const monsterConfig = {
  木桩,
  蟑螂,
  蜈蚣,
  蛇,
  地牢守卫,
  蜘蛛,
  青蛙
}